app/views/questions/_form.html.erb

    <div class="controls">
      <%= select_tag :exam_id1, options_for_select(Exam.order('name ASC').map {|e| [e.name, e.id]}), :prompt=> "Select Exam 1", :class => 'number_field' %>
---
SELECT `exams`.* FROM `exams` ORDER BY name ASC