app/views/questions/index.html.erb

    <div class="page-header-mine">
      <h3 class="questions-head">Questions of <%= Exam.find(params[:exam]).name %></h3>
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1