app/views/branches/_form.html.erb

SELECT `courses`.* FROM `courses` ORDER BY name ASC
---
    <div class="controls">
      <%= f.select :course_id, Course.order('name ASC').map {|c| [c.name, c.id]}, :class => 'number_field' %>