app/views/subjects/_form.html.erb

SELECT `courses`.* FROM `courses` ORDER BY name ASC
---
    <div class="controls">
      <%= f.collection_select :course_id, Course.order("name ASC"), :id, :name, {:prompt => 'Select Course'}, :class => 'number_field', :onchange => "get_course_branches(this.value)" %>