app/controllers/branches_controller.rb

  def index
    @branches = Branch.all
---
SELECT `branches`.* FROM `branches`

  def show
    @branch = Branch.find(params[:id])
---
SELECT `branches`.* FROM `branches` WHERE `branches`.`id` = 1 LIMIT 1

  def edit
    @branch = Branch.find(params[:id])
---
SELECT `branches`.* FROM `branches` WHERE `branches`.`id` = 1 LIMIT 1

  def create
    @branch = Branch.new(params[:branch])

    respond_to do |format|
      if @branch.save
---
INSERT INTO `branches` (`course_id`, `created_at`, `name`, `updated_at`) VALUES (1, '2013-04-07 07:27:31', 'CSE', '2013-04-07 07:27:31')

  def update
    @branch = Branch.find(params[:id])

    respond_to do |format|
      if @branch.update_attributes(params[:branch])
---
SELECT `branches`.* FROM `branches` WHERE `branches`.`id` = 1 LIMIT 1
UPDATE `branches` SET `course_id` = 2, `updated_at` = '2013-04-07 07:29:28' WHERE `branches`.`id` = 1

  def destroy
    @branch = Branch.find(params[:id])
    @branch.destroy
---
SELECT `branches`.* FROM `branches` WHERE `branches`.`id` = 6 LIMIT 1
DELETE FROM `branches` WHERE `branches`.`id` = 6