app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def edit
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`created_at`, `name`, `updated_at`) VALUES ('2013-04-06 15:00:15', 'Gate', '2013-04-06 15:00:15')

  def update
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def get_course_branches
    course = Course.find(params[:id])

    course_branches = course.branches.order("name ASC").select("branches.id, branches.name")
    @course_options = "<option value=''>Select</option>"
    unless course_branches.empty?
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT branches.id, branches.name FROM `branches` WHERE `branches`.`course_id` = 1 ORDER BY name ASC
SELECT COUNT(*) FROM `branches` WHERE `branches`.`course_id` = 1