app/controllers/exams_controller.rb

  def index
    @exams = Exam.all
---
SELECT `exams`.* FROM `exams`

  def show
    @exam = Exam.find(params[:id])
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1

  def edit
    @exam = Exam.find(params[:id])
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1

  def create
    @exam = Exam.new(params[:exam])
    @exam.branch_id = params[:branch_id]
    respond_to do |format|
      if @exam.save
---
INSERT INTO `exams` (`created_at`, `exam_type`, `name`, `subject_id`, `updated_at`) VALUES ('2013-04-07 14:07:35', 'test', 'Gate mock exam', NULL, '2013-04-07 14:07:35')

  def update
    @exam = Exam.find(params[:id])

    respond_to do |format|
      if @exam.update_attributes(params[:exam])
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`id` = 4 LIMIT 1
UPDATE `exams` SET `exam_type` = 'gate2', `updated_at` = '2013-04-07 14:22:36' WHERE `exams`.`id` = 5

  def destroy
    @exam = Exam.find(params[:id])
    @exam.destroy
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1
DELETE FROM `exams` WHERE `exams`.`id` = 1