app/controllers/questions_controller.rb

  def index
    @exams=Exam.all
    if params[:exam]
      @questions = Exam.find(params[:exam]).questions
    else
      @questions = Question.all
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`id` = 1 LIMIT 1
SELECT `questions`.* FROM `questions`

  def show
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def edit
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def create
    @question = Question.new(params[:question])
    exam_ids = [params[:exam_id1],params[:exam_id2],params[:exam_id3],params[:exam_id4]]
    exams = exam_ids.reject(&:empty?)
    respond_to do |format|

      if exams.length > 0
        if @question.save
---
INSERT INTO `questions` (`correct_answer`, `created_at`, `exam_id`, `incorrect_answer_1`, `incorrect_answer_2`, `incorrect_answer_3`, `qavatar`, `question`, `updated_at`) VALUES ('mtech', '2013-04-27 06:17:31', 1, 'ms', 'mba', 'msc', 'images.jpg', 'gate?', '2013-04-27 06:17:31')

  def update
    @question = Question.find(params[:id])
    exam_ids = [params[:exam_id1],params[:exam_id2],params[:exam_id3],params[:exam_id4]]
    exams = exam_ids.reject(&:empty?)
    respond_to do |format|
      if exams.length > 0
        if @question.update_attributes(params[:question])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
UPDATE `questions` SET `question` = 'gate?fdg g gfd th \r\n t\r\nrg rt g\r\nrt \r\nrt \r\ntr \r\nt t\r\n tr \r\n\r\n \r\n \r\ntrgrttgg???????????????/', `updated_at` = '2013-04-13 10:56:25' WHERE `questions`.`id` = 2

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 1