app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects`
---
  def index
    @subjects = Subject.all

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def edit
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`branch_id`, `course_id`, `created_at`, `name`, `updated_at`) VALUES (1, 1, '2013-04-07 07:39:19', 'ADS', '2013-04-07 07:39:19')
---
  def create
    @subject = Subject.new(params[:subject])
    @subject.branch_id = params[:branch_id]
    respond_to do |format|
      if @subject.save

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `course_id` = 2, `updated_at` = '2013-04-13 10:11:53' WHERE `subjects`.`id` = 1
---
  def update
    @subject = Subject.find(params[:id])

    respond_to do |format|
      if @subject.update_attributes(params[:subject])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 2
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy